mode(3.1415) # [1] "numeric"
mode(c(2, 3, 4, 5.5)) # [1] "numeric"
mode("Tom") # [1] "character"
mode(c("Tom", "Yoon", "Kim")) # [1] "character"
mode(factor(c("A", "B", "C"))) # [1] "numeric"
mode(list("Tom", "Yoon", "Kim")) # [1] "list"
mode(data.frame(x = 1:3, y = c("Tom", "Yoon", "Kim"))) # [1] "list"
mode(print) # [1] "function"(함수)

source("C:/자료실/서다현/R 스크립트/10.R")
transaction[1]
transaction["transactionId"]
transaction[[2]]
transaction[["transactionItem"]]
transaction$transactionId

pi # [1] 3.141593
length(pi) # [1] 1

a = 1:9
dim(a) = c(3, 3)
a
#       [,1] [,2] [,3]
# [1,]    1    4    7
# [2,]    2    5    8
# [3,]    3    6    9
b = 1:12; dim(b) = c(2, 3, 2)
b
# , , 1
# 
#       [,1] [,2] [,3]
# [1,]    1    3    5
# [2,]    2    4    6
# 
# , , 2
# 
#       [,1] [,2] [,3]
# [1,]    7    9   11
# [2,]    8   10   12

a = seq(1, 6); b = seq(7, 9)
a+b # [1]  8 10 12 11 13 15
cbind(a, b)
#      a b
# [1,] 1 7
# [2,] 2 8
# [3,] 3 9
# [4,] 4 7
# [5,] 5 8
# [6,] 6 9

a = c(a, 7) # 데이터(7) 추가
a[length(a)+1] = 8 # 데이터(8) 추가
append(b, 10, after = 9) # (9 이후) 데이터(10) 삽입
f = factor(a); f = factor(a, levels = a) # 요인 생성
comb = stack(list(a = a, b = b, c = x)) # 여러 벡터 합치기
a[c(1, 3, 5, 7)] # [1] 1 3 5 7
a[-c(2, 4)] # [1] 1 3 5 6 7 8
list(1, "a", print) # 리스트 생성
x = c(1, 2, 3, 4); y = c(6.25, 3.14, 5.18); z = c("fee", "fie", "fun")
L = list(x, y, z)
# [[1]]
# [1] 1 2 3 4
# 
# [[2]]
# [1] 6.25 3.14 5.18
# 
# [[3]]
# [1] "fee" "fie" "fun"
L = list(X = x, Y = y, Z = z)
# $X
# [1] 1 2 3 4
# 
# $Y
# [1] 6.25 3.14 5.18
# 
# $Z
# [1] "fee" "fie" "fun"
L[[1]] # [1] 1 2 3 4
L[c(1, 2, 3)]
# [[1]]
# [1] 1 2 3 4
# 
# [[2]]
# [1] 6.25 3.14 5.18
# 
# [[3]]
# [1] "fee" "fie" "fun"
L[["X"]] # [1] 1 2 3 4
L$Y # [1] 6.25 3.14 5.18
L[["Z"]] = NULL
# $X
# [1] 1 2 3 4
# 
# $Y
# [1] 6.25 3.14 5.18
L[sapply(L, is.null)] = NULL; L[is.na(L)] = NULL # NULL 제거
matrix(1, 2, 3)
#       [,1] [,2] [,3]
# [1,]    1    1    1
# [2,]    1    1    1
c = matrix(b, 2, 3); c
#      [,1] [,2] [,3]
# [1,]    7    9    8
# [2,]    8    7    9
d = matrix(0, 4, 5); d
#       [,1] [,2] [,3] [,4] [,5]
# [1,]    0    0    0    0    0
# [2,]    0    0    0    0    0
# [3,]    0    0    0    0    0
# [4,]    0    0    0    0    0
e = matrix(1:20, 4, 5); e
#       [,1] [,2] [,3] [,4] [,5]
# [1,]    1    5    9   13   17
# [2,]    2    6   10   14   18
# [3,]    3    7   11   15   19
# [4,]    4    8   12   16   20
dim(c) # [1] 2 3 (차원 반환)
diag(e) # [1]  1  6 11 16 (대각선값 반환)
t(d) # 전치행렬 반환
#       [,1] [,2] [,3] [,4]
# [1,]    0    0    0    0
# [2,]    0    0    0    0
# [3,]    0    0    0    0
# [4,]    0    0    0    0
# [5,]    0    0    0    0
g = matrix(1:4, 2, 2); solve(g)
#       [,1] [,2]
# [1,]   -2  1.5
# [2,]    1 -0.5
b%*%y
#        [,1]
# [1,] 115.49
b%*%t(y)
#       [,1]  [,2]  [,3]
# [1,] 43.75 21.98 36.26
# [2,] 50.00 25.12 41.44
# [3,] 56.25 28.26 46.62
rownames(d) = c("1", "2", "3", "4") # 행 이름 부여
colnames(d) = c("a", "b", "c", "d", "e") # 열 이름 부여
#   a b c d e
# 1 0 0 0 0 0
# 2 0 0 0 0 0
# 3 0 0 0 0 0
# 4 0 0 0 0 0
b+y # [1] 13.25 11.14 14.18
b-y # [1] 0.75 4.86 3.82
b+1 # [1]  8  9 10
b-1 # [1] 6 7 8
b%*%b
#      [,1]
# [1,]  194
b*3 # [1] 21 24 27
vec = c[1,]; vec # [1] 7 9 8
vec = c[, 3]; vec # [1] 8 9
