print("a") # [1] "a"
cat("a", "b", "c") # a b c

ls() # 변수 목록 출력
ls.str() # 모든 변수 출력

rm() # 변수 삭제
c() # 벡터 생성
function() {} # 함수 정의
  
a <- 1; a = 1 # 데이터 할당
print(a) # [1] 1
x = c(1, 2, 3, 4)
y = c(6.25, 3.14, 5.18)
z = c("fee", "fie", "fun")
w = c(x, y, z)

1:5 # [1] 1 2 3 4 5
9:-2 #  [1]  9  8  7  6  5  4  3  2  1  0 -1 -2
seq(from = 0, to = 20, by = 2) #  [1]  0  2  4  6  8 10 12 14 16 18 20
seq(from = 0, to = 20, length.out = 5) # [1]  0  5 10 15 20
rep(1, time = 5) # [1] 1 1 1 1 1
rep(1:4, each = 2) # [1] 1 1 2 2 3 3 4 4
rep(c(1, 10), each = 2) # [1]  1  1 10 10
A = paste("a", "b", "c", sep = "-")
A # [1] "a-b-c"
paste(A, c("e", "f")) # [1] "a-b-c e" "a-b-c f"
paste(A, 10, sep = "") # [1] "a-b-c10"
paste(A, 10, sep = " ") # [1] "a-b-c 10"
substr("Bigdataanalysis", 1, 4) # [1] "Bigd"
a = TRUE
a # [1] TRUE
b = F
b # [1] FALSE

w[1] # [1] "1"
w[-1] # [1] "2"    "3"    "4"    "6.25" "3.14" "5.18" "fee"  "fie"  "fun"
a$coef # 요소, 슬롯 뽑아내기
5^2 # [1] 25
5%/%2 # [1] 2 나눗셈의 몫
5%%2 # [1] 1 나눗셈의 나머지
n = c(5, 6, 7, 8)
x%*%n; #행렬의 곱
# [,1]
# [1,]   70
3*5 # [1] 15
3/5 # [1] 0.6
3-5 # [1] -2
3==5 # [1] FALSE
3 != 5 # [1] TRUE
3 > 5 # [1] FALSE
3 <= 5 # [1] TRUE
!(3==5) # [1] TRUE 식 부정
3 -> m
m # [1] 3

mean(x) # [1] 2.5 평균
sum(x) # [1] 10 합
median(y) # [1] 5.18 중앙값
log(y) # [1] 1.832581 1.144223 1.644805 로그값
sd(x) # [1] 1.290994 표준편차
var(x) # [1] 1.666667 분산
cov(x, n) # [1] 1.666667 공분산
cor(x, n) # [1] 1 상관계수
length(x) # 변수의 길이
